package alert.example.com.alertdialog;

import android.content.DialogInterface;
import android.support.v7.app.AlertDialog;
import android.support.v7.app.AppCompatActivity;
import android.os.Bundle;
import android.view.View;
import android.widget.Button;
import android.widget.Toast;
import android.content.DialogInterface.OnCancelListener;

public class MainActivity extends AppCompatActivity {

    Button b,fitor,azha;
    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_main);


        fitor = (Button) findViewById(R.id.button);
        fitor.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View view) {
                AlertDialog alertDialog = new AlertDialog.Builder(
                        MainActivity.this).create();

                alertDialog.setTitle("ঈদ-উল-ফিতর, কেন মুসলিমের সব চেয়ে বড় উৎসব ?");

                alertDialog.setMessage("--------------------------\n" + "\n" + "বিসমিল্লাহির রাহমানির রাহিম...\n" +
                        "\n" +
                        " \n" +
                        "\n" +
                        "আনাস ইবন মালিক (রাঃ) বরনিতঃ\n" +
                        "\n" +
                        "\" রাসুললাহ (সঃ) যখন [মদিনায়] আসলেন ,তখন তাদের ২টি উৎসবের দিন ছিল। তিনি (সঃ) বলেন 'এ ২ টি দিন এর তাৎপর্য কি?' তারা বলল 'জাহিলিয়াতের যুগে আমরা এ ২ টি দিনে উৎসব করতাম।' রাসুলুল্লাহ (সঃ) বললেন ' আল্লাহ্\u200C তোমাদের কে এদের পরিবর্তে উত্তম কিছু দিয়েছেনঃ ইয়াওমুদ্দুহা ও ইয়াওমুল ফিতর।\"\n" +
                        "\n" +
                        " \n" +
                        "\n" +
                        "এ হাদিস থেকে দেখা যাচ্ছে যে ইসলাম আগমনের পর ইসলাম বহির্ভূত সকল উৎসবকে বাতিল করে দেয়া হয়েছে এবং নতুন উৎসবের জন্য দুটো দিন কে নির্ধারণ করা হয়েছে। সেই সাথে অমুসলিমদের অনুসরন এর যাবতীয় উৎসব পালনের পথকে বন্ধ করা হয়েছে।\n" +
                        "\n" +
                        " \n" +
                        "\n" +
                        "অমুসলিম ,কাফির , কিংবা মুশরিকদের উৎসব এর দিন গুলো হচ্ছে তাদের জন্য উচ্ছৃঙ্খল আচরনের দিন, এ দিনে তারা নৈতিকতার সকল বাঁধ ভেঙ্গে দিয়ে অশ্লীল কর্মকাণ্ডে লিপ্ত হয়। আর এই কর্মকাণ্ডের অবধারিত রুপ হচ্ছে মদ্যপান ও ব্যভিচার । এমনকি খ্রিস্টান সম্প্রদায় এর বহুলোক বড়দিনে ও ভাবগাম্ভীর্যকে জলাঞ্জলি দিয়ে মদ্যপ হয়ে উঠে, এবং পশ্চিমা বিশ্বে এই রাত্রিতে কিছু লোক নিহত হয় মদ্যপ অবস্থায় গাড়ি চালানোর কারণে।\n" +
                        "\n" +
                        " \n" +
                        "\n" +
                        "অপরদিকে মুসলিমদের উৎসব হচ্ছে এবাদাতের সাথে সম্পৃক্ত। এই বিষয়টি বুঝতে হলে ইসলামের সার্বিকটাকে বুঝতে হবে। ইসলাম কেবল কিছু আচার - অনুষ্ঠান এর সমষ্টি নয়, বরং টা মানুষের গোটা জীবনকে আল্লাহ'র সন্তুষ্টি অনুযায়ী বিন্যস্ত ও সজ্জিত করতে উদ্যোগী হয়। তাই একজন মুস্লিমের জন্য জীবনের গোটা উদ্দেশ্যেই হচ্ছে এবাদাত, যেমনটি কুরআনে আল্লাহ্\u200C ঘোষণা করেছ্বন\n" +
                        "\n" +
                        " \n" +
                        "\n" +
                        "                            \"আমি জিন ও মানুষকে আমার এবাদাত করা ছাড়া অন্য  কোন কারণে সৃষ্টি করিনি। \"(৫২:৫৬)\n" +
                        "\n" +
                        " \n" +
                        "\n" +
                        "সেজন্য মুসলিম জীবনের আনন্দ- উৎসব আল্লাহর বিরুদ্ধাচারন ও অশ্লীলতা নয়। বরং টা নিহিত হচ্ছে আল্লাহর দেয়া আদেশ পালন করতে পারার মাঝে। কেননা মুসলিমের ভোগবিলাসের স্থান ক্ষণস্থায়ী পৃথিবী নয়,বরং চিরস্থায়ী জান্নাত। তাই মুসলিমের জীবনের প্রতিটি কাজের রন্ধ্রে রন্ধ্রে জড়িয়ে থাকবে তাদের ধর্মীয় মূল্যবোধ ,তাদের ঈমান , আখিরাত এর প্রতি তাদের বিশ্বাস ,আল্লাহর প্রতি তাদের ভয় ও  ভালবাসা।\n" +
                        "\n" +
                        "তাই ঈদ- উল- ফিতর ও ঈদ- উল- আযাহ... - এ দুটি উৎসবই নির্ধারণ করা হয়েছে ইসলামের দুটি স্তম্ভ সম্পন্ন করার প্রাক্কালে। ইসলামের চতুর্থ স্তম্ভ সাওম পালন করার পর পর ই মুসলিমরা পালন করে ঈদ- উল- ফিতর। কেননা এই দিন্ টি আল্লাহর আদেশ পালনের পর আল্লাহের কাছ থেকে পুরষ্কার ও ক্ষমার ঘোষণা পাওয়ার দিন বিধায় এটি সাওম পালনকারির জন্য বাস্তবিকই উৎসবের দিন। এ দিন এজন্য উৎসবের দিন নয় যে এইদিন এ আল্লাহর নিষেধ ভুলে গিয়ে অশ্লীল কর্মকাণ্ডে লিপ্ত হয়। বরং মুসলিমদের জীবনে এমন একটি মুহূর্ত নেই , যে মুহূর্তে টার ওপর আল্লাহর আদেশ নিশেধ শিথিলযোগ্য।\n" +
                        "\n" +
                        "তেমনি ভাবে ঈদ- উল- আযাহ পালিত হয় ইসলামের পঞ্চম স্তম্ভ হজ্ব পালনের প্রাক্কালে । কেননা ৯ই জিলহজ্জ হচ্ছে আনন্দের দিন- ঈদ- উল আযাহ। এমনিভাবে মুসলিমদের উৎসবের এ দুটি দিন প্রকৃতপক্ষে আল্লাহকে বেশি বেশি স্মরণ করার দিন। তার প্রতি কৃতজ্ঞতা প্রকাশের দিন এবং শারিয়াত মোতাবেক বৈধ আনন্দ উপভোগ করার দিন- এই উৎসব মুসলিমদের এমানের চেতনার সাথে একই সূত্রে গাঁথা।\n" +
                        "\n" +
                        " \n" +
                        "\n" +
                        "বর্তমানের আমরা যারা ঈদ পালন করি ,তারা কি কখনো এভাবে চিন্তা করি? অনেকে বলে থাকেন ঈদ এর চেয়ে নাকি তাদের কাছে পহেলা বৈশাখ,31st night বেশি উপভোগ্য, তারা বেশি মজা করতে পারেন এই দিন গুলোতে... । তাদের কাছে আমার প্রশ্ন হল 'আপনি কি একজন মুসলিম হিসেবে এ কথা বলছেন? \" এক জন মুসলিমের কাছে ঈদ এর চেয়ে বেশি অন্য কোন অনুষ্ঠান প্রিয় হতে পারে না। এবং মুসলিমদের জন্য এ দুটি উৎসব নির্ধারণ করা হয়েছে। তাই নিজেকে প্রশ্ন করুন আপনি কি মুসলিম ? নাকি বাঙ্গালী?\n" +
                        "\n" +
                        "কোন অমুসলিমকে দেখেছেন আপানার সাথে এসে একটি রোজা রাখতে? দেখবেন নাহ,কারন তারা তাদের পরিচয়, তাদের বিশ্বাস এর দিক দিয়ে ঠিক অবস্থানেই আছে।  তবে আমরা কেন নিজেদের পরিচয় ভুলে গিয়ে পদে পদে ঠকর খাবো? ইহকাল , পরকাল ২ ই হারাবো?\n" +
                        "\n" +
                        "আল্লাহ্\u200C তালা আমাদের সঠিকটা বুঝবার তাওফিক দান করুন। আসুন এবারের রমজানে আমরা কেনাকাটা ,রান্না-বান্নায় ব্যস্ত না থেকে এর সঠিক মূল্যায়ন করি... এমন তো হতে পারে এটাই আমাদের শেষ রামজান !!!\n" +
                        "\n" +
                        " \n" +
                        "\n" +
                        "জাযাকাল্লাহ খায়ের... ফী আমানিল্লাহ।");

                alertDialog.setButton(DialogInterface.BUTTON_POSITIVE, "Back", new DialogInterface.OnClickListener() {

                    public void onClick(DialogInterface dialog, int which) {
                        dialog.dismiss();

                    }
                });

                alertDialog.show();
            }
        });


        azha = (Button) findViewById(R.id.buttonAzha);
        azha.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View view) {
                AlertDialog alertDialog = new AlertDialog.Builder(
                        MainActivity.this).create();

                alertDialog.setTitle("ঈদুল আযহা");

                alertDialog.setMessage("--------------------------------\n" + "\n" + "ঈদুল আযহা বা ঈদুল আজহা (আরবীতে:عيد الأضحى) ইসলাম ধর্মাবলম্বিদের সবচেয়ে বড় দু'টো ধর্মীয় উৎসবের একটি। বাংলাদেশে এই উৎসবটি কুরবানির ঈদ নামে পরিচিত। ঈদুল আযহা মূলত আরবী বাক্যাংশ।এর অর্থ হলো ত্যাগের উৎসব। আসলে এটির মূল প্রতিপাদ্য বিষয় হচ্ছে ত্যাগ করা। এ দিনটিতে মুসলমানেরা তাদের সাধ্যমত ধর্মীয় নিয়মানুযায়ী উট, গরু, দুম্বা কিংবা ছাগল কোরবানি বা জবাই দেয়।\n" +
                        "\n" +
                        "ইতিহাস\n" +
                        "\n" +
                        "ইসলামের বিভিন্ন বর্ননা অণুযায়ী, মহান আল্লাহ তাআলা ইসলামের নবী হযরত ইব্রাহীম(আঃ)কে স্বপ্নে তার সবচেয়ে প্রিয় বস্তুটি কুরবানী করার নির্দেশ দেন। এই আদেশ অণুযায়ী হযরত ইব্রাহিম(আঃ)তার সবচেয়ে প্রিয় পুত্র ইসমাইলকে কুরবানি করার জন্য প্রস্তুত হলে স্রষ্টা তাকে তা করতে বাধা দেন এবং পুত্রের পরিবর্তে পশু কুরবানীর নির্দেশ দেন। এই ঘটনাকে স্মরণ করে সারা বিশ্বের মুসলিম ধর্মাবলম্বীরা আল্লাহ তাআলার সন্তুষ্ঠি অর্জনের জন প্রতি বছর এই দিবসটি পালন করে। হিজরি বর্ষপঞ্জি হিসাবে জিলহজ্জ্ব মাসের ১০ তারিখ থেকে শুরু করে ১২ তারিখ পর্যন্ত ৩ দিন ধরে ঈদুল আজহা চলে। হিজরী চান্দ্র বছরের গণনা অণুযায়ী ঈদুল ফিতর এবং ঈদুল আজহার মাঝে ২ মাস ১০ দিন ব্যবধান থাকে। দিনের হিসেবে যা সবোর্চ্চ ৭০ দিন হতে পারে।\n" +
                        "\n" +
                        "পশু কুরবানি\n" +
                        "\n" +
                        "ইসলাম মতে যার যাকাত দেয়ার সামর্থ্য আছে তাঁর ওপর ঈদুল আযহা উপলক্ষে পশু কুরবানি করা ওয়াজীব। ঈদুল আযহার দিন থেকে শুরু করে পরবর্তী দুইদিন পশু কুরবানির জন্য নির্ধারিত। বাংলাদেশের মুসলমানরা সাধারণত গরু বা খাসী কুরবানি দিয়ে থাকেন। এক ব্যক্তি একটি গরু, মহিষ বা খাসি কুরবানি করতে পারেন। তবে গরুর বা মহিষ এর ক্ষেত্রে সর্বোচ্য ৭ ভাগে কুরবানি করা যায় অর্থাৎ ২, ৩, ৫ বা ৭ ব্যক্তি একটি গরু কুরবানিতে শরিক হতে পারেন। সাধারণত আমাদের দেশে কুরবানির মাংস তিন ভাগে ভাগ করে ১ ভাগ গরিব-দুঃস্থদের মধ্যে ১ ভাগ আত্মীয় স্বজনদের মধ্যে এবং ১ ভাগ নিজেদের খাওয়ার জন্য রাখা হয়, তবে মাংশ বিতরনের কোন সুস্পষ্ট হুকুম নেই কারন কুরবানীর হুকুম যবাই হওয়ার দ্বারা পালন হয়ে যায়।\n" +
                        "\n" +
                        "কুরবানির পশুর চামড়া বিক্রির অর্থ দান করে দেয়ার নির্দেশ রয়েছে। মুসাফির বা ভ্রমঙ্কারির ওপর কুরবানি করা ওয়াজিব নয়| ঈদুল আযহার নামাজের আগে কুরবানি করা সঠিক নয়।\n" +
                        "\n" +
                        "কুরবানির খাসীর বয়স কমপক্ষে ১ বছর হতে হবে। গরু ও মহিষের বয়স কমপক্ষে ২ বছর হতে হবে। নিজ হাতে কুরবানি করা ভাল। কুরবানি প্রাণির দক্ষিণ দিকে রেখে কিবলামুখী করে, ধারালো অস্ত্র দিয়ে 'বিস্মিল্লাহি আল্লাহু আকবার' বলে জবাই করতে হয়।");

                alertDialog.setButton(DialogInterface.BUTTON_POSITIVE, "Back", new DialogInterface.OnClickListener() {

                    public void onClick(DialogInterface dialog, int which) {
                        dialog.dismiss();

                    }
                });

                alertDialog.show();
            }
        });


        Button procholon;
        procholon = (Button) findViewById(R.id.buttonProcholon);
        procholon.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View view) {
                AlertDialog alertDialog = new AlertDialog.Builder(
                        MainActivity.this).create();

                alertDialog.setTitle("ঈদের প্রচলন কীভাবে শুরু হয়?");

                alertDialog.setMessage("---------------------------\n" + "\n" + "রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যখন মাক্কা থেকে মাদ্বীনায় হিজরত করলেন তখন মাদ্বীনাবাসীদের মধ্যে বিশেষ দু’টি দিবস ছিল, সে দিবসে তারা খেলাধুলা করত। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম জিজ্ঞেস করলেন এ দু’টি দিনের তাৎপর্য কী? মাদ্বীনাবাসীরা উত্তর দিল আমরা জাহেলী যুগ থেকে এ দু’দিনে খেলাধুলা করে আসছি। তখন রাসূলে করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন,\n" +
                        "\n" +
                        "قَدْ أَبْدَلَكُمُ اللهُ خَيْرًا مِنْهُمَا يَوْمُ الأَضَحٰى وَيَوْمُ الْفِطْرِ\n" +
                        "\n" +
                        "আল্লাহ রাববুল ‘আলামীন এ দু’দিনের পরিবর্তে এর চেয়েও উত্তম দু’টি দিন তোমাদেরকে দান করেছেন। আর সেই দিন দু’টি হল : ঈদুল আযহা ও ঈদুল ফিতর। (আবূ দাউদ : ১১৩৪; নাসাঈ : ১৫৫৬)\n");

                alertDialog.setButton(DialogInterface.BUTTON_POSITIVE, "Back", new DialogInterface.OnClickListener() {

                    public void onClick(DialogInterface dialog, int which) {
                        dialog.dismiss();

                    }
                });
                alertDialog.show();
            }
        });


        b = (Button) findViewById(R.id.buttonArtho);
        b.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View view) {
                AlertDialog alertDialog = new AlertDialog.Builder(
                        MainActivity.this).create();

                // Setting Dialog Title
                alertDialog.setTitle("ঈদ অর্থ কী?");

                // Setting Dialog Message
                alertDialog.setMessage("-------------------------------\n" + "\n" + "ঈদ অর্থ আনন্দ। এর শাব্দিক অর্থ হলো ‘বারবার ফিরে আসা’ (عَادَ-يَعُوْدُ-عِيْدًا) এ দিনটি বারবার ফিরে আসে বলে এর নামকরণ হয়েছে ঈদ। আল্লাহ তা‘আলা এদিনে তার বান্দাকে নি‘আমাত ও অনুগ্রহ দ্বারা বারবার ধন্য করে থাকেন, বারবার ইহসান করেন। রমযানের পানাহার নিষিদ্ধ করার পর আবার পানাহারের আদেশ প্রদান করেন। ফিত্\u200Cরা প্রদান ও গ্রহণ, হজ পালন ও কুরবানীর গোশত ভক্ষণ ইত্যাদি নি‘আমাত বছর ঘুরিয়ে তিনি বারবার বান্দাদেরকে ফিরিয়ে দেন। এতে মানুষের প্রাণে আনন্দের সঞ্চার হয়। এসব কারণে এ দিবসের নামকরণ হয়েছে ঈদ। ");

                // Setting OK Button
                alertDialog.setButton(DialogInterface.BUTTON_POSITIVE, "Back", new DialogInterface.OnClickListener() {

                    public void onClick(DialogInterface dialog, int which) {
                        dialog.dismiss();

                    }
                });

                // Showing Alert Message
                alertDialog.show();
            }
        });

        Button hukum;
        hukum = (Button) findViewById(R.id.hukum);
        hukum.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View view) {
                AlertDialog alertDialog = new AlertDialog.Builder(
                        MainActivity.this).create();

                // Setting Dialog Title
                alertDialog.setTitle("ঈদের সালাতের হুকুম কী?");

                // Setting Dialog Message
                alertDialog.setMessage("-------------------------------\n" + "\n" + "ইমাম আবূ হানীফা (রহ.) বলেছেন, ঈদের সালাত প্রত্যেক ব্যক্তির উপর ওয়াজিব। ইমাম ইবনে তাইমিয়্যাহ একই মত পোষণ করেন। ");

                // Setting OK Button
                alertDialog.setButton(DialogInterface.BUTTON_POSITIVE, "Back", new DialogInterface.OnClickListener() {

                    public void onClick(DialogInterface dialog, int which) {
                        dialog.dismiss();

                    }
                });

                // Showing Alert Message
                alertDialog.show();
            }
        });


        Button koronio;
        koronio = (Button) findViewById(R.id.koronio);
        koronio.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View view) {
                AlertDialog alertDialog = new AlertDialog.Builder(
                        MainActivity.this).create();

                // Setting Dialog Title
                alertDialog.setTitle("ঈদের সালাতের আগে আমাদের করণীয় কী কী?");

                // Setting Dialog Message
                alertDialog.setMessage("-------------------------------\n" + "\n" + "নিম্নবর্ণিত কাজগুলো করা সুন্নাত/মুস্তাহাব।\n" +
                        "\n" +
                        "১. গোসল করা, পরিষ্কার পোশাক পরিধান করা মুস্তাহাব।\n" +
                        "\n" +
                        "২. ঈদুল ফিতরের দিন খাবার খেয়ে ঈদের সালাতে যাওয়া, আর ঈদুল আযহার দিন না খেয়ে ঈদগাহে যাওয়া সুন্নাত। তাছাড়া ঈদুল আযহার সালাত শেষে কুরবানীর গোশত দিয়ে খাবার গ্রহণ করা সুন্নাত।\n" +
                        "\n" +
                        "৩. ঈদগাহে পায়ে হেটে যাওয়া মুস্তাহাব। আর একপথে যাবে এবং ভিন্ন পথ দিয়ে আবার পায়ে হেটেই আসা সুন্নাত।\n" +
                        "\n" +
                        "৪. তাকবীর পড়া এবং তা বেশি বেশি ও উচ্চস্বরে পড়া সুন্নাত। রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ঘর থেকে ঈদগাহ পর্যন্ত তাকবীর দিতে দিতে যেতেন। \n" +
                        "\n" +
                        "উল্লেখ্য যে, ফজরের সালাতের পর ঈদের সালাতের পূর্বে অন্য কোন নফল সালাত নেই। ");

                // Setting OK Button
                alertDialog.setButton(DialogInterface.BUTTON_POSITIVE, "Back", new DialogInterface.OnClickListener() {

                    public void onClick(DialogInterface dialog, int which) {
                        dialog.dismiss();

                    }
                });

                // Showing Alert Message
                alertDialog.show();
            }
        });

        Button pushak;
        pushak = (Button) findViewById(R.id.pushak);
        pushak.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View view) {
                AlertDialog alertDialog = new AlertDialog.Builder(
                        MainActivity.this).create();


                alertDialog.setTitle("ঈদের দিন রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কী ধরনের পোশাক পরতেন?");


                alertDialog.setMessage("-------------------------------\n" + "\n" + "আল্লামা ইবনু কাইয়িম (রহ.) তার সুপ্রসিদ্ধ গ্রন্থ যাদুল মা‘আদে লিখেছেন, নাবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ঈদের দিন উত্তম পোশাক পরিধান করতেন। তাঁর এক জোড়া পোশাক ছিল যা দু’ ঈদ ও জুমু‘আর দিন পরিধান করতেন। অন্য এক হাদীসে রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন :\n" +
                        "\n" +
                        "إِنَّ اللهَ تَعَالٰى يُحِبُّ أَنْ يَرى أَثَرَ نِعْمَتِهِ عَلٰى عَبْدِهِ\n" +
                        "\n" +
                        "আল্লাহ রাববুল আলামীন তার বান্দার উপর তার প্রদত্ত নি‘আমাতের প্রকাশ দেখতে পছন্দ করেন। (তিরমিযী : ২৮১৯)\n ");


                alertDialog.setButton(DialogInterface.BUTTON_POSITIVE, "Back", new DialogInterface.OnClickListener() {

                    public void onClick(DialogInterface dialog, int which) {
                        dialog.dismiss();

                    }
                });


                alertDialog.show();
            }
        });

        Button KAPORk;
        KAPORk = (Button) findViewById(R.id.KAPOR);
        KAPORk.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View view) {
                AlertDialog alertDialog = new AlertDialog.Builder(
                        MainActivity.this).create();


                alertDialog.setTitle("পুরুষ লোকের রেশমী কাপড় পরার হুকুম কি?");


                alertDialog.setMessage("-------------------------------\n" + "\n" + "পুরুষদের জন্য রেশমী কাপড় পরা হারাম। আবদুল্লাহ ইবনে উমার রাদিয়াল্লাহু আনহু থেকে বর্ণিত। উমার রাদিয়াল্লাহু আনহু একবার বাজার থেকে একটি রেশমী কাপড়ের জুব্বা নিয়ে এলেন এবং রাসূলে কারীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লামকে তা দিয়ে বললেন : (হে আল্লাহর রাসূল) আপনি এটি কিনে নিন। ঈদের সময় ও আগত গণ্যমান্য অতিথিদের সাথে সাক্ষাতের সময় এটা পরিধান করবেন। তখন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন,\n" +
                        "\n" +
                        "إِنَّمَا هٰذِهِ لِبَاسٌ مَنْ لاَخَلاَقَ لَهُ\n" +
                        "\n" +
                        "‘এটা ঐ ব্যক্তির পোশাক যে আখিরাতে আল্লাহর কাছে কিছুই পাবে না।’ তাছাড়া বর্তমান সিল্ক হিসেবে যেসব কাপড় পাওয়া যায় সেগুলোও রেশমী কাপড়। (বুখারী : ৯৪৮)\n ");


                alertDialog.setButton(DialogInterface.BUTTON_POSITIVE, "Back", new DialogInterface.OnClickListener() {

                    public void onClick(DialogInterface dialog, int which) {
                        dialog.dismiss();

                    }
                });


                alertDialog.show();
            }
        });

        Button KHABAR;
        KHABAR = (Button) findViewById(R.id.KHABAR);
        KHABAR.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View view) {
                AlertDialog alertDialog = new AlertDialog.Builder(
                        MainActivity.this).create();


                alertDialog.setTitle("ঈদের দিন খাবার গ্রহণ বিষয়ে রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম’র সুন্নাত কী ছিল?");


                alertDialog.setMessage("-------------------------------\n" + "\n" + "১. নাবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ঈদুল ফিতরের দিন না খেয়ে ঘরে থেকে বের হতেন না। আর ঈদুল আযহার দিন ঈদের সালাত আদায় না করে কোন কিছু খেতেন না।\n" +
                        "\n" +
                        "كَانَ رَسُوْلُ اللهِ -صلى الله عليه وسلم- لاَ يَغْدُوْ يَوْمَ الْفِطْرِ حَتّٰى يَأْكُلَ تَمَرَاتٍ\n" +
                        "\n" +
                        "২. ঈদুল ফিতরের দিন রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম খেজুর না খেয়ে ঈদগাহে রওয়ানা হতেন না। আনাস বলেন, আর খেজুর খেতেন বেজোড় সংখ্যায় (অর্থাৎ তিনটি, পাঁচটি বা সাতটি এভাবে)। (বুখারী : ৯৫৩)\n ");


                alertDialog.setButton(DialogInterface.BUTTON_POSITIVE, "Back", new DialogInterface.OnClickListener() {

                    public void onClick(DialogInterface dialog, int which) {
                        dialog.dismiss();

                    }
                });


                alertDialog.show();
            }
        });

        Button SALAT;
        SALAT = (Button) findViewById(R.id.SALAT);
        SALAT.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View view) {
                AlertDialog alertDialog = new AlertDialog.Builder(
                        MainActivity.this).create();


                alertDialog.setTitle("ঈদের সালাত");


                alertDialog.setMessage("-------------------------------\n" + "\n" + "" +
                        "ঈদগাহে কখন যাওয়া উত্তম?" +
                        "\n" +
                        "ঈদগাহে তাড়াতাড়ি যাওয়া উচিৎ যাতে ইমাম সাহেবের কাছাকাছি বসা যায়, প্রথম কাতারে সালাত আদায় করা যায়। তাছাড়া সালাতের জন্য অপেক্ষা করা এসব অতীব সওয়াবের কাজ।\n" +
                        "\n" +
                        "ঈদের সালাতে যাওয়া-আসায় রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম দু’টি পথ ব্যবহার করতেন। একপথে যেতেন, ভিন্ন আর এক পথে বাড়ী ফিরতেন। এর হিকমত কী?\n" +
                        "\n" +
                        "উলামায়ে কিরাম এ বিষয়ে বিভিন্ন হিকমাত বর্ণনা করেছেন। এর মধ্যে কেউ কেউ বলেছেন :\n" +
                        "\n" +
                        "১. পথ ভিন্ন ভিন্ন হলে উভয় পথের লোকদের সালাম দেয়া যায় এবং ঈদের শুভেচ্ছা বিনিময় করা যায়।\n" +
                        "\n" +
                        "২. মুসলিমদের অবস্থা ও শান শওকত পর্যবেক্ষণ করতে পারা যায়।\n" +
                        "\n" +
                        "৩. গাছপালা তরুলতা ও মাটি মুসল্লীদের পক্ষে স্বাক্ষী হয়ে থাকতে পারে।\n ");


                alertDialog.setButton(DialogInterface.BUTTON_POSITIVE, "Back", new DialogInterface.OnClickListener() {

                    public void onClick(DialogInterface dialog, int which) {
                        dialog.dismiss();

                    }
                });


                alertDialog.show();
            }
        });

        Button TAKBIR;
        TAKBIR = (Button) findViewById(R.id.TAKBIR);
        TAKBIR.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View view) {
                AlertDialog alertDialog = new AlertDialog.Builder(
                        MainActivity.this).create();


                alertDialog.setTitle("ঈদের তাকবীর");


                alertDialog.setMessage("-------------------------------\n" + "\n" + "ঈদের দিন রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যে তাকবীর পড়তে পড়তে যেতেন সেটি কোন তাকবীর?" +
                        "\n" +
                        "\n" +
                        " তাকবীরটি হল :\n" +
                        "\n" +
                        "اَللهُ أَكْبَرُ اللهُ أَكْبَرُ لاَ إِلَهَ إِلاَّ اللهُ\n" +
                        "\n" +
                        "اَللهُ أَكْبَرُ اللهُ أَكْبَرُ وَللهِ الْحَمْدُ\n" +
                        "\n" +
                        "উচ্চারণ : আল্লাহু আকবার আল্লাহু আকবার লা ইলাহা ইল্লাল্লাহ। আল্লাহু আকবার আল্লাহু আকবার ওয়া লিল্লাহিল হামদ।\n" +
                        "\n" +
                        "অর্থ : আল্লাহ মহান, আল্লাহ অতিমহান, তিনি ছাড়া সত্যিকার আর কোন মা‘বুদ নেই। আল্লাহ মহান আল্লাহ মহান আর সমস্ত প্রশংসা শুধুমাত্র তাঁরই জন্য।\n" +
                        "\n" +
                        "তাকবীর কীভাবে পড়ব?\n" +
                        "\n" +
                        "তাকবীর প্রকাশ্যে ও উচ্চস্বরে পড়া সুন্নাত। আর তা বেশি বেশি পড়াও সুন্নাত।\n" +
                        "\n" +
                        "তাকবীর পাঠ কখন শুরু ও শেষ করব?\n" +
                        "\n" +
                        "ঈদগাহের উদ্দেশ্যে ঘর থেকে বের হয়ে তাকবীর পাঠ শুরু করবে এবং ইমাম সাহেব সালাত শুরু করার পূর্ব পর্যন্ত তাকবীর পাঠ করতে থাকবে।\n" +
                        "\n" +
                        "ইমাম ইবনে তাইমিয়্যাহ (রহঃ) বলেছেন, ঈদুল ফিতরের তাকবীর শুরু করবে ঈদের চাঁদ উদিত হওয়ার পর থেকেই। ঈদের সালাত শেষ হওয়া পর্যন্ত রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাকবীর পাঠ করতেন।\n ");


                alertDialog.setButton(DialogInterface.BUTTON_POSITIVE, "Back", new DialogInterface.OnClickListener() {

                    public void onClick(DialogInterface dialog, int which) {
                        dialog.dismiss();

                    }
                });


                alertDialog.show();
            }
        });


        Button NIYOMm;
        NIYOMm = (Button) findViewById(R.id.NIYOMm);
        NIYOMm.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View view) {
                AlertDialog alertDialog = new AlertDialog.Builder(
                        MainActivity.this).create();


                alertDialog.setTitle("ঈদের নামাজ পড়ার নিয়ম ");


                alertDialog.setMessage("-------------------------------\n" + "\n" + "ঈদের নামাজ দুই রাকাআত। ঈদের নামাজ আদায় করা ওয়াজিব। যা জামাআতের সহিত পড়তে হয়। এ নামাজে অতিরিক্ত ছয় তাকবির দিতে হয়ে। প্রথম রাকায়াতে তাকবিরে তাহরিমাসহ ৪ তাকবির। ইমাম সাহেব তাকবিরে তাহরিমার মাধ্যমে নিয়্ত বাধার পর ছানা পড়ার পর তিন তাকবির দিবেন। মুসল্লিরাও সেই সঙ্গে সঙ্গে দু’হাত কাঁধ পর্যন্ত উঠাবেন এবং তাকবির দিবেন। তিন তাকবির শেষ হলে অন্যান্য নামাজের মতো হাত নাভীর উপর রাখবে। তার পর ইমাম সাহেব নামাজ পড়াবেন।\n" +
                        "\n" +
                        "দ্বিতীয় রাকাআতে ইমাম সাহেব সূরা ফাতিহার সঙ্গে সূরা মিলানোর পর তিন তাকবির দিবেন। মুক্তাদিগণ ইমামের সঙ্গে সঙ্গে তিন তাকবির বলবেন এবং কাঁধ পর্যন্ত হাত উঠাবেন। ৪র্থ তাকবিরে রুকুতে যাবেন। তার পর সালামের মাধ্যমে নামাজ শেষ করবেন। ঈদের নামাজের আগে পরে কোনো নফল বা সুন্নত নামাজ নাই।\n ");


                alertDialog.setButton(DialogInterface.BUTTON_POSITIVE, "Back", new DialogInterface.OnClickListener() {

                    public void onClick(DialogInterface dialog, int which) {
                        dialog.dismiss();

                    }
                });


                alertDialog.show();
            }
        });


        Button MASLA;
        MASLA = (Button) findViewById(R.id.MASAYEL);
        MASLA.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View view) {
                AlertDialog alertDialog = new AlertDialog.Builder(
                        MainActivity.this).create();


                alertDialog.setTitle("ঈদের নামাজের কিছু মাসায়িল");


                alertDialog.setMessage("-------------------------------\n" + "\n" + "ক. রমাদানুল মুবারকের পরে শাওয়ালের প্রথম তারিখ ফজরের পর ২ রাকাত ঈদ-উল-ফিতরের নামাজ আদায় করা ওয়াজিব। এ সালাত মুসাফির, অসুস্থ এবং নারীদের জন্য ওয়াজিব নয়। তবে তারা উপযুক্ত পরিবেশে থাকলে এবং ঈদগাহে আসতে পারলে সাওয়াব পাবে। (বাদায়ে সানায়েফি তারতীব আল শারইয়ে)\n" +
                        "\n" +
                        "খ. ঈদের নামাজ আদায়ের সময় হলো শাওয়াল মাসের প্রথম তারিখ সূর্য উদয়ের পর থেকে সূর্য পশ্চিমাকাশে ঢলে পড়ার আগ পর্যন্ত। তবে বৃষ্টি, আবহাওয়া বা দুর্যোগ পরিবেশ ইত্যাদি কারণে মসজিদেও যদি ঈদের সালাত আদায় করা না যায় তাহলে ২রা শাওয়াল ওজর বশত ফজর থেকে ঠিক দ্বিপ্রহরের আগ পর্যন্ত আদায় করতে পারবে। দ্বিতীয় দিনও যদি আদায় করতে না পারে তাহলে এ সালাত আদায় করার আর সময় থাকবে না। (আল কাসানী)\n" +
                        "\n" +
                        "গ. ঈদের নামাজে অতিরিক্ত তাকবিরগুলো দেয়া ওয়াজিব। ঈদের সালাতে আযান ও ইক্বামত নেই। বাড়তি তাকবিরগুলোর সময় রাফ‘য়ে ইয়াদাইন তথা দুই হাত উঠানো সুন্নাত। ইমাম সাহেব তাকবিরগুলো মধ্যখানে তিন তাসবিহ পরিমাণ অবকাশ দিবেন। যাতে করে (বড় জামায়াতে) মুক্তাদিদের ইমামকে অনুসরণ করতে কোনো অসুবিধা না হয়।(আল কাসানী)\n" +
                        "\n" +
                        "ঘ. কেউ যদি ঈদের সালাতে অংশগ্রহণে দেরি করে এবং ইমামের সাথে প্রথম রাকায়াতে অংশগ্রহণ করে কিন্তু অতিরিক্ত তাকবিরগুলো পেল না তাহলে প্রথমে তাকবিরে তাহরিমা বাধার পর নিজে নিজে প্রথম রাকায়াতের তাকবিরগুলো দিবে। কিন্তু তাকবিরগুলো দিতে গিয়ে যদি রুকু হারানোর সম্ভাবনা থাকে তাহলে তাকবিরে তাহরিমার পর তাকবির দিয়ে রুকুতে যাবে এবং তাসবিহ না পড়ে প্রথম রাকায়াতের অতিরিক্ত তাকবিরগুলো রুকুতে পড়বে (তখন তাকবির দিতে রাফ‘য়ে য়াদাইন বা হাত তুলতে হবে না)। এভাবে কেউ যদি দ্বিতীয় রাকাতে অংশগ্রহণ করে এবং অতিরিক্ত তাকবিরগুলো না পায় বরং রুকু পায় তাহলে রুকুতে রুকুর তাসবিহ না পড়ে দ্বিতীয় রাকায়াতের তাকবিরগুলো পড়বে এবং ইমাম সাহেব সালাম ফিরানোর পর উঠে গিয়ে প্রথম রাকায়াত যেভাবে ইমাম সাহেব আদায় করেছেন সেভাবে আদায় করবে।(তোহফাতুল ফোক্বাহা) ");


                alertDialog.setButton(DialogInterface.BUTTON_POSITIVE, "Back", new DialogInterface.OnClickListener() {

                    public void onClick(DialogInterface dialog, int which) {
                        dialog.dismiss();

                    }
                });


                alertDialog.show();
            }
        });


        Button KUR;
        KUR = (Button) findViewById(R.id.KURBANI);
        KUR.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View view) {
                AlertDialog alertDialog = new AlertDialog.Builder(
                        MainActivity.this).create();


                alertDialog.setTitle("কুরবানী কার উপর ওয়াজিব হয়?");


                alertDialog.setMessage("-------------------------------\n" + "\n" + "প্রাপ্তবয়ষ্ক, সুস্থমস্তিষ্কসম্পন্ন প্রত্যেক মুসলমান নর-নারী মুকীম ব্যক্তি, যে ১০ যিলহজ্ব সুবহে সাদিক থেকে ১২ যিলহজ্ব সূর্যাস্ত পর্যন্ত সময়ের মধ্যে প্রয়োজন অতিরিক্ত নেসাব পরিমাণ সম্পদের মালিক হবে তার উপর কুরবানী করা ওয়াজিব হবে। নেসাব হল : স্বর্ণের ক্ষেত্রে সাড়ে সাত (৭.৫) ভরি। আর রুপার ক্ষেত্রে সাড়ে বায়ান্ন (৫২.৫) ভরি। আর অন্যান্য বস্ত্তর ক্ষেত্রে সাড়ে বায়ান্ন ভরি রুপার সমমূল্যের সম্পদ। স্বর্ণ বা রুপার কোনো একটি যদি পৃথকভাবে নেসাব পরিমাণ না হয় তবে স্বর্ণ-রুপা উভয়টি মিলে কিংবা এর সাথে প্রয়োজন-অতিরিক্ত অন্য বস্ত্তর মূল্য মিলে সাড়ে বায়ান্ন ভরি রুপার সমমূল্যের হয়ে যায় সেক্ষেত্রেও কুরবানী ওয়াজিব হবে। স্বর্ণ-রুপার অলঙ্কার, নগদ অর্থ, যে জমি বাৎসরিক খোরাকীর জন্য প্রয়োজন হয় না এবং প্রয়োজন অতিরিক্ত আসবাবপত্র-এ সবই কুরবানীর নেসাবের ক্ষেত্রে হিসাবযোগ্য।\n" +
                        "-বাদায়েউস সানায়ে ৪/১৯৬,আলমুহীতুল বুরহানী ৮/৪৫৫; ফাতাওয়া তাতারখানিয়া ১৭/৪০৫ ");


                alertDialog.setButton(DialogInterface.BUTTON_POSITIVE, "Back", new DialogInterface.OnClickListener() {

                    public void onClick(DialogInterface dialog, int which) {
                        dialog.dismiss();

                    }
                });


                alertDialog.show();
            }
        });


        Button TAKA;
        TAKA = (Button) findViewById(R.id.NIYOMKURBANI);
        TAKA.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View view) {
                AlertDialog alertDialog = new AlertDialog.Builder(
                        MainActivity.this).create();


                alertDialog.setTitle("কী পরিমাণ টাকা থাকলে কুরবানী ওয়াজিব হয়?");


                alertDialog.setMessage("-------------------------------\n" + "\n" + "কুরবানীর দিনগুলোতে (১০ যিলহজ্ব ফজর থেকে ১২ যিলহজ্ব সূর্যাস্ত পর্যন্ত) সাড়ে বায়ান্ন তোলা রুপা বা এর সমমূল্যের প্রয়োজনের অতিরিক্ত সম্পদের মালিক হলে কুরবানী ওয়াজিব হয়। এর চেয়ে কম সম্পদের মালিক হলে কুরবানী ওয়াজিব হয় না। (আহকামুল কুরআন, জাসসাস ৩/১২৮; আলমুহীতুল বুরহানী ৮/৪৫৫)\n" +
                        "উল্লেখ্য, টাকা-পয়সা, সোনা-রুপার অলংকার, ব্যবসায়িক পণ্য, প্রয়োজন অতিরিক্ত জমি, সারা বছরেও ব্যবহার হয় না এমন অপ্রয়োজনীয় আসবাবপত্র এসব কিছুর মূল্য কুরবানীর নেসাবের ক্ষেত্রে হিসাবযোগ্য। সুতরাং আপনার নিকট জমা টাকা এবং প্রয়োজন অতিরিক্ত সম্পদ মিলে সাড়ে বায়ান্ন তোলা রুপার বর্তমান মূল্য পরিমাণ থাকলে আপনার উপর কুরবানী ওয়াজিব। অন্যথায় ওয়াজিব নয়।\n" +
                        "হাদীসে কুরবানীর অনেক ফযীলত বর্ণিত হয়েছে। যেমন এক হাদীসে আছে, কুরবানীর দিন পশু কুরবানীর চেয়ে আল্লাহ তাআলার নিকট প্রিয় কোনো আমল নেই। (জামে তিরমিযী, হাদীস : ১/১৮০)\n" +
                        "অন্য হাদীসে আছে, হযরত আলী রা. বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ফাতেমাকে তার কুরবানীর নিকট উপস্থিত থাকতে বললেন এবং ইরশাদ করলেন, এই কুরবানীর প্রথম রক্তবিন্দু প্রবাহিত হওয়ার সাথে সাথেই আল্লাহ তাআলা তোমার গুনাহসমুহ মাফ করে দিবেন। তিনি জিজ্ঞাসা করলেন, এটা কি শুধু আহলে বাইতের জন্য? না সকল মুসলমানের জন্য? তিনি বললেন, এই ফযীলত সকল মুসলমানের জন্য।\n" +
                        "-আলমুততাজিরুর রাবেহ ৩১৬; মাজমাউয যাওয়াইদ ৪/১৭; আততারগীব ওয়াততারহীব ১/১৭৫ ");


                alertDialog.setButton(DialogInterface.BUTTON_POSITIVE, "Back", new DialogInterface.OnClickListener() {

                    public void onClick(DialogInterface dialog, int which) {
                        dialog.dismiss();

                    }
                });


                alertDialog.show();
            }
        });


        Button M;
        M = (Button) findViewById(R.id.MASLA);
        M.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View view) {
                AlertDialog alertDialog = new AlertDialog.Builder(
                        MainActivity.this).create();


                alertDialog.setTitle("গুরুত্বপূর্ণ  মাসায়ালা");


                alertDialog.setMessage("-------------------------------\n" + "\n" + "ঈদগাহে কখন যাওয়া উত্তম?" +
                        "\n" +
                        " ঈদগাহে তাড়াতাড়ি যাওয়া উচিৎ যাতে ইমাম সাহেবের কাছাকাছি বসা যায়, প্রথম কাতারে সালাত আদায় করা যায়। তাছাড়া সালাতের জন্য অপেক্ষা করা এসব অতীব সওয়াবের কাজ।\n" +
                        "\n" +
                        "ঈদের দিন রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যে তাকবীর পড়তে পড়তে যেতেন সেটি কোন তাকবীর?\n" +
                        "\n" +
                        "তাকবীরটি হল :\n" +
                        "\n" +
                        "اَللهُ أَكْبَرُ اللهُ أَكْبَرُ لاَ إِلَهَ إِلاَّ اللهُ\n" +
                        "\n" +
                        "اَللهُ أَكْبَرُ اللهُ أَكْبَرُ وَللهِ الْحَمْدُ\n" +
                        "\n" +
                        "উচ্চারণ : আল্লাহু আকবার আল্লাহু আকবার লা ইলাহা ইল্লাল্লাহ। আল্লাহু আকবার আল্লাহু আকবার ওয়া লিল্লাহিল হামদ।\n" +
                        "\n" +
                        "অর্থ : আল্লাহ মহান, আল্লাহ অতিমহান, তিনি ছাড়া সত্যিকার আর কোন মা‘বুদ নেই। আল্লাহ মহান আল্লাহ মহান আর সমস্ত প্রশংসা শুধুমাত্র তাঁরই জন্য।\n" +
                        "\n" +
                        "\n" +
                        "তাকবীর কীভাবে পড়ব?\n" +
                        "\n" +
                        "তাকবীর প্রকাশ্যে ও উচ্চস্বরে পড়া সুন্নাত। আর তা বেশি বেশি পড়াও সুন্নাত।\n" +
                        "\n" +
                        "\n" +
                        "তাকবীর পাঠ কখন শুরু ও শেষ করব?\n" +
                        "\n" +
                        "\n" +
                        "ঈদগাহের উদ্দেশ্যে ঘর থেকে বের হয়ে তাকবীর পাঠ শুরু করবে এবং ইমাম সাহেব সালাত শুরু করার পূর্ব পর্যন্ত তাকবীর পাঠ করতে থাকবে।\n" +
                        "\n" +
                        "ইমাম ইবনে তাইমিয়্যাহ (রহঃ) বলেছেন, ঈদুল ফিতরের তাকবীর শুরু করবে ঈদের চাঁদ উদিত হওয়ার পর থেকেই। ঈদের সালাত শেষ হওয়া পর্যন্ত রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাকবীর পাঠ করতেন।\n" +
                        "\n ");


                alertDialog.setButton(DialogInterface.BUTTON_POSITIVE, "Back", new DialogInterface.OnClickListener() {

                    public void onClick(DialogInterface dialog, int which) {
                        dialog.dismiss();

                    }
                });


                alertDialog.show();
            }
        });


        Button Q;
        Q = (Button) findViewById(R.id.Q);
        Q.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View view) {
                AlertDialog alertDialog = new AlertDialog.Builder(
                        MainActivity.this).create();


                alertDialog.setTitle(" কিছু প্রশ্ন-উত্তর ও গুরুত্বপূর্ণ  মাসায়ালা");


                alertDialog.setMessage("-------------------------------\n" + "\n" + "ঈদের সালাতে যাওয়া-আসায় রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম দু’টি পথ ব্যবহার করতেন। একপথে যেতেন, ভিন্ন আর এক পথে বাড়ী ফিরতেন। এর হিকমত কী?\n" +
                        "\n" +
                        "উলামায়ে কিরাম এ বিষয়ে বিভিন্ন হিকমাত বর্ণনা করেছেন। এর মধ্যে কেউ কেউ বলেছেন :\n" +
                        "\n" +
                        "১. পথ ভিন্ন ভিন্ন হলে উভয় পথের লোকদের সালাম দেয়া যায় এবং ঈদের শুভেচ্ছা বিনিময় করা যায়।\n" +
                        "\n" +
                        "২. মুসলিমদের অবস্থা ও শান শওকত পর্যবেক্ষণ করতে পারা যায়।\n" +
                        "\n" +
                        "৩. গাছপালা তরুলতা ও মাটি মুসল্লীদের পক্ষে স্বাক্ষী হয়ে থাকতে পারে।\n" +
                        "\n" +
                        "\n" +
                        "ঈদুল ফিতর ও ঈদুল আযহা- এর কোনটি আওয়াল ওয়াক্তে (অর্থাৎ প্রথম ওয়াক্তে) পড়ব?\n" +
                        "\n" +
                        "ইবনুল কায়্যিম (রহ.) বলেছেন,\n" +
                        "\n" +
                        "নাবী কারীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ঈদুল ফিতরের সালাত একটু দেরী করে আদায় করতেন। আর ঈদুল আযহার সালাত প্রথম ওয়াক্তে তাড়াতাড়ি আদায় করতেন। (যাদুল মা‘আদ)\n" +
                        "\n" +
                        "এ বিষয়ক সকল হাদীস বিশ্লেষণ করলে পরিষ্কার বুঝা যায় যে, সূর্যোদয়ের পর থেকে দেড় ঘণ্টার মধ্যে ঈদুল আযহা এবং আড়াই ঘণ্টার মধ্যে ঈদুল ফিতর পড়া উত্তম।\n" +
                        "\n" +
                        "\n" +
                        "\n" +
                        "রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ঈদুল ফিতরের সালাত ঈদুল আযহার সালাতের চেয়ে একটু দেরী করে পড়তেন কেন?\n" +
                        "\n" +
                        "তুলনামূলক ভাবে ঈদুল ফিতরের সালাত রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম একটু দেরী করে পড়তেন এ কারণে যাতে লোকেরা সাদাকাতুল ফিতর (অর্থাৎ ফিত্\u200Cরা) প্রদানের প্রয়োজনীয় কাজগুলো সেরে নিয়ে ঈদগাহে যেতে পারে।\n" +
                        "\n" +
                        "আর ঈদুল আযহা তাড়াতাড়ি প্রথম ওয়াক্তে আদায় করতেন যাতে করে সালাত শেষ করে কুরবানীর পশু জবাইয়ের কাজ সম্পন্ন করতে পারে।\n" +
                        "\n" +
                        "\n" +
                        "\n" +
                        "ঈদের সালাত কোথায় আদায় করা সুন্নাত?\n" +
                        "\n" +
                        "কোন একটা মাঠে ঈদের সালাত আদায় করা সুন্নাত।\n" +
                        "\n" +
                        "\n" +
                        "\n" +
                        "নাবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কোথায় ঈদের সালাত আদায় করতেন?\n" +
                        "\n" +
                        "যাদুল মা‘আদ কিতাবে ইবনুল কায়্যিম (রহ.) লিখেছেন যে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আজীবন ঈদের সালাত ঈদগাহে আদায় করেছেন।\n" +
                        "\n" +
                        "হাদীসে আছে যে,\n" +
                        "\n" +
                        "عَنْ أَبِيْ سَعِيْدٍ الْخُدْرِيِّ قَالَ كَانَ رَسُوْلُ اللهِ -صلى الله عليه وسلم- يَخْرُجُ يَوْمَ الْفِطْرِ وَالأَضْحَى إِلَى الْمُصَلَّى\n" +
                        "\n" +
                        "আবূ সাঈদ খুদরী রাদিয়াল্লাহু আনহু থেকে বর্ণিত তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ঈদুল ফিতর ও ঈদুল আযহার সালাত আদায়ের জন্য ঈদগাহে যেতেন। (বুখারী : ৯৫৬)\n" +
                        "\n" +
                        "\n" +
                        "\n" +
                        "বৃষ্টি, ঝড়-তুফান ও নিরাপত্তহীনতা ইত্যাদি অবস্থায় মাসজিদে ঈদের সালাত আদায় করা কি জায়েয হবে?\n" +
                        "\n" +
                        "হা, জায়েয আছে।\n" +
                        "\n" +
                        "আবূ হুরাইরাহ রাদিয়াল্লাহু আনহু বলেন, একবার বৃষ্টি হওয়ায় নাবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সবাইকে নিয়ে মাসজিদে ঈদের সালাত আদায় করেছিলেন। (আবূ দাউদ, ইবনে মাজাহ মিশকাত)\n" +
                        "\n" +
                        "(অবশ্য নাসিরুদ্দ্বীন আলবানী (রহ.) এটাকে দুর্বল হাদীস বলেছেন)\n" +
                        "\n" +
                        "\n" +
                        "\n" +
                        "ঈদের সালাতে কোন আযান ও ইকামাত নেই এ বিষয়ে দলীল আছে কি?\n" +
                        "\n" +
                        "হাঁ, দলীল আছে।\n" +
                        "\n" +
                        "(১) ইবনে আব্বাস ও জাবের রাদিয়াল্লাহু আনহু থেকে বর্ণিত, তারা বলেন,\n" +
                        "\n" +
                        "لَمْ يَكُنْ يُؤَذِّنْ يَوْمَ الْفِطْرِ وَيَوْمَ الأَضْحٰى\n" +
                        "\n" +
                        "(রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম’র যামানায়) ঈদুল ফিতর ও ঈদুল আযহার সালাতে আযান দেয়া হতো না। (বুখারী : ৯৬০)\n" +
                        "\n" +
                        "(২) জাবের ইবনে সামুরা রাদিয়াল্লাহু আনহু থেকে বর্ণিত, তিনি বলেন,\n" +
                        "\n" +
                        "صَلَّيْتُ مَعَ رَسُوْلِ اللهِ -صلى الله عليه وسلم- الْعِيْدَيْنِ غَيْرَ مَرَّةٍ وَلاَ مَرَّتَيْنِ بِغَيْرِ آذَانٍ وَلاَ إِقَامَةٍ\n" +
                        "\n" +
                        "আমি বহুবার রাসূলে কারীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম’র সাথে দু’ ঈদের সালাত আদায় করেছি কোন আযান ও ইকামাত ছাড়াই। (মুসলিম : ৮৮৭)\n" +
                        "\n" +
                        "\n" +
                        "\n" +
                        "ঈদের সালাত কত রাকআত?\n" +
                        "\n" +
                        "দুই রাকা‘আত।\n" +
                        "\n" +
                        "উমার রাদিয়াল্লাহু আনহু বলেন,\n" +
                        "\n" +
                        "صَلاَةُ الْجُمُعَةِ رَكْعَتَانِ وَصَلاَةُ الْفِطْرِ رَكْعَتَانِ وَصَلاَةُ الأَضْحَى رَكْعَتَانِ وَصَلاَةُ السَّفَرِ رَكْعَتَانِ\n" +
                        "\n" +
                        "জুমু‘আর সালাত দু’ রাক‘আত, ঈদুল ফিতরের সালাত দু’ রাক‘আত, ঈদুল আজহার সালাত দু’ রাক‘আত এবং সফর অবস্থায় (চার রাক‘আত বিশিষ্ট ফরয) সালাত দুই রাক‘আত। (নাসাঈ : ১৪২০)\n" +
                        "\n" +
                        "\n" +
                        "\n" +
                        "এ দু’ রাক‘আত ঈদের সালাতের আগে পরে কি রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কোন নফল সুন্নাত সালাত পড়তেন?\n" +
                        "\n" +
                        "না, ঈদের সালাতের সাথে এর আগে পরে রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কোন নফল সুন্নাত সালাত আদায় করেননি। (মুসনাদে আহমাদ)\n" +
                        "\n" +
                        "\n" +
                        "\n" +
                        "ঈদের সালাতে দাঁড়িয়ে তাকবীরে তাহরীমা বাধার পর ‘‘আল্লাহু আকবার বলে অতিরিক্ত যে কিছু তাকবীর দেয়া হয় এর মোট সংখ্যা কত?\n" +
                        "\n" +
                        "এ বিষয়ে প্রধানতঃ দু’টি মত রয়েছে :\n" +
                        "\n" +
                        "ক. ১ম ও ২য় রাক‘আতে অতিরিক্ত ৩ + ৩ = মোট ৬ তাকবীর। এটি হানাফী মাযহাবের ইমাম আবূ হানিফার (রহ.) মত।\n" +
                        "\n" +
                        "(খ) দ্বিতীয় মত হল :\n" +
                        "\n" +
                        "১ম ও ২য় রাক‘আতে যথাক্রমে অতিরিক্ত ৭ + ৫ = মোট ১২ তাকবীর। এটি বাকী ৩ মাযহাবের মত।\n" +
                        "\n" +
                        "\n" +
                        "\n" +
                        "যারা অতিরিক্ত ৬ তাকবীরে ঈদের সালাত আদায় করেন তাদের দলীল কি?\n" +
                        "\n" +
                        "ইবনে মাসউদ রাদিয়াল্লাহু আনহু বর্ণিত একটি রেওয়ায়েতে ৪ তাকবীরে ঈদের নামাযের স্বপক্ষে একটি হাদীস পাওয়া যায়। একদল ফকীহ এ ৪ তাকবীরকে প্রথম রাকাতে তাকবীরে উলার সাথে ৩ তাকবীর এবং দ্বিতীয় রাকাতে রুকুর তাকবীর সহ ৩ তাকবীর-এভাবে অতিরিক্ত ৬ তাকবীরের ব্যাখ্যা দিয়েছেন। উল্লেখ্য, মুহাদ্দিস আল্লামা নাসিরুদ্দ্বীন আলবানী (রহঃ) এটাকে দুর্বল হাদীস বলেছেন।\n ");


                alertDialog.setButton(DialogInterface.BUTTON_POSITIVE, "Back", new DialogInterface.OnClickListener() {

                    public void onClick(DialogInterface dialog, int which) {
                        dialog.dismiss();

                    }
                });


                alertDialog.show();
            }
        });
    }
    }

